# Specify directory to install
cask_args appdir: "/Applications"

brew "cloc"
brew "gh"
brew "git"
brew "jupyterlab"
brew "lua"
brew "neovim"
brew "pnpm"
brew "redis"
brew "ruff"
brew "spicetify-cli"
brew "uv"
brew "zsh-autocomplete"
cask "coconutbattery"
cask "dbeaver-community"
cask "docker-desktop"
cask "firefox"
cask "github"
cask "google-chrome"
cask "kitty"
cask "legcord"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-teams"
cask "microsoft-word"
cask "obsidian"
cask "pycharm"
cask "raycast"
cask "spotify"
cask "tempbox"
cask "visual-studio-code"
cask "whatsapp"
cask "zed"
cask "zoom"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "yoavbls.pretty-ts-errors"
